// 더미 데이터로만 남겨두겠습니다.

let ms2_dungeon_tagtypes=[["p","ms2-dungeon-type ms2-dictdata-title"],["p","ms2-dungeon-name ms2-dictdata-title"],["p","ms2-require-level"],["p","ms2-minimum-require-players"],["p","ms2-maximum-require-players"],["p","ms2-dungeon-enter-condition"],["p","ms2-dungeon-description"],["p","ms2-dungeon-release-date"],["p","ms2-dungeon-closed-date"]];
let ms2_dungeon_datas=[
    
    //모험[일반] 던전
    ["모험[일반]", "벛꽃 숲의 비밀",17,1,4,],
    ["모험[일반]", "오염된 정원",17,1,4],
    ["모험[일반]", "골든타워 7층",21,1,4],
    ["모험[일반]", "골든타워 4층",21,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "골든 엘리베이터",21,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "암탉 구출 대작전",21,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "포이즌 케이브",23,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "뱅코르타",28,1,4],
    ["모험[일반]", "꽃비 숲길",29,1,4],
    ["모험[일반]", "그림자 군단의 제단",30,1,4],
    ["모험[일반]", "최후의 바야르",33,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "전쟁 로봇의 반란",33,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "왕궁 지하",34,1,4],
    ["모험[일반]", "혼돈의 숲",35,1,4],
    ["모험[일반]", "생명의 틈",36,1,4],
    ["모험[일반]", "이그니코르",38,1,4],
    ["모험[일반]", "감시탑 성벽",38,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "호루스의 둥지",39,1,4],
    ["모험[일반]", "루디브리엄 시계탑",1,1,4],
    ["모험[일반]", "달빛선장의 요새",41,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "카트라무스 하층부",43,1,4],
    ["모험[일반]", "카트라무스 상층부",43,1,4],
    ["모험[일반]", "루디블 타임홀",48,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "어둠의 뿌리",48,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "뮤로스 촬영장",48,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "잊혀진 바야르",50,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "찬바람 동굴",50,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "환상 피라미드",50,1,4],
    ["모험[일반]", "얼어붙은 신전",50,1,4],
    ["모험[일반]", "트로닉스 벙커",50,1,4],
    ["모험[일반]", "폭주열차 블랙노프 1호",50,1,4],
    ["모험[일반]", "카사 델 루나",50,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    ["모험[일반]", "어둠의 이면",50,1,4],
    ["모험[일반]", "푸른 그림자 동굴",50,1,4],
    ["모험[일반]", "폭주열차 블랙노프 2호",50,1,4],
    ["모험[일반]", "인도자의 성지",50,1,4,,"던전 설명 넣는 곳",,"2020-07-09"],
    
    //모험[어려움] 던전 (50레벨)
    ["모험[어려움]", "불의 용",50,1,4,["아이템점수 6500"],"용가리를 잡으시오"],
    ["모험[어려움]", "불멸의 신전",50,1,4,["아이템점수 6700"],"발록",,"2020-07-09"],
    ["모험[어려움]", "미궁의 집회당",50,1,4,["아이템점수 6700"],"카보",,"2020-07-09"],
    ["모험[어려움]", "루벨리스크",50,1,4,["아이템점수 6700"],"바르칸트",,"2020-07-09"],
    ["모험[어려움]", "룬의 성전",50,1,4,["아이템점수 6700"],"누타만(누진만)",,"2020-07-09"],
    ["모험[어려움]", "비욘드 링크 트리스",50,1,4,["아이템점수 7230"],"칸두라",,"2020-07-09"],
    ["리버스 레이드","악마의 나무",50,1,10,["아이템점수 5000"]],

    //카오스 레이드 던전 (50레벨)
    ["카오스 레이드","그림자 군단의 제단",50,1,10],
    ["카오스 레이드","불멸의 신전",50,1,10],
    ["카오스 레이드","달빛선장의 요새",50,1,10],
    ["카오스 레이드","시계탑",50,1,10],
    ["카오스 레이드","루벨리스크",50,1,10],
    ["카오스 레이드","룬의 성전",50,1,10,["아이템점수 7230"],"누타만",,"2020-07-09"],
    ["카오스 레이드","비욘드 링크 트리스",50,1,10,["아이템점수 7230"],"칸두라",,"2020-07-09"],
    
    

    //(구)52 ~ 56 던전
    ["모험[일반]","신녀의 노랫소리",52,1,4,["아이템점수 7150점"],"던전 설명 넣는 곳","2017-01-12","2018-07-05"],
    ["모험[일반]","대양의 수호신",52,1,4,["아이템점수 7400점"],"던전 설명 넣는 곳","2017-01-12","2018-07-05"],
    ["모험[일반]","눈보라 산맥",54,1,4,["아이템점수 7500점"],"던전 설명 넣는 곳","2017-01-12","2018-07-05"],
    ["모험[일반]","마드라칸 성벽",54,1,4,["아이템점수 7550점", "트로피 : 분노의 요새 : 성벽 공략 획득"],"던전 설명 넣는 곳","2017-02-09","2018-07-05"],
    ["모험[일반]","마드라칸 잠입",56,1,4,["아이템점수 7700점"],"던전 설명 넣는 곳","2017-02-09","2018-07-05"],
    ["모험[일반]","사무친 원한의 대저택",56,1,4,["아이템점수 7650점"],"던전 설명 넣는 곳","2017-02-09","2018-07-05"],
    ["모험[어려움]","서릿발 신전",54,1,10,["아이템점수 7600점"],"던전 설명 넣는 곳","2017-01-12","2018-07-05"],
    ["모험[어려움]","마드라칸 첨탑",56,1,10,["아이템점수 7850점", "트로피 : 분노의 요새 : 침투로 확보"],"던전 설명 넣는 곳",,"2018-07-05"],
    ["카오스 레이드","서릿발 신전",54,1,10,["아이템점수 6700점"],"던전 설명 넣는 곳","2017-01-12","2018-07-05"],
    ["카오스 레이드","마드라칸 첨탑",56,1,10,["아이템점수 8000점", "트로피 : 분노의 요새 : 침투로 확보", "입장 요일 : 일요일, 월요일, 수요일, 금요일"],"던전 설명 넣는 곳","2017-02-09","2018-07-05"],
    ["리버스 레이드","이계의 존재",56,1,10,["아이템점수 8200점", "입장 요일 : 토요일, 일요일"],"던전 설명 넣는 곳","2017-07-27","2018-07-05"],

    //캐시마트 아르바이트
    ["이벤트","캐시마트 아르바이트",1,4,4,,"던전 블라블라","2017-02-23"],
    

    // 스카이 포트리스, 그리고 불멸의 인페르녹
    ["포트리스 럼블","스카이 포트리스 함교 상층부",50,1,1,["아이템점수 6750점"],"블리체", "2018-02-01"],
    ["포트리스 럼블","트라이아 근위대 체력 단련장",50,1,1,["아이템점수 6750점"],"콘대르", "2018-02-01"],
    ["포트리스 럼블","네이린의 전투 시뮬레이터",50,1,1,["아이템점수 6750점"],"네이린", "2018-02-01"],
    ["포트리스 럼블","기사단 고등 지휘부 접견 구역",50,1,1,["아이템점수 6750점"],"메이슨", "2018-02-01"],
    ["포트리스 럼블","쉐도우윈드 비밀 훈련 시설",50,1,1,["아이템점수 6750점"],"샤텐", "2018-02-01"],
    ["월드 인베이전","인페르녹 최후의 방어선",56,2,10,["아이템점수 8000점", "트로피 : 스카이 포트리스의 빛 달성"],"15분동안 버텨야 하는 던전","2018-01-25"],
    
    // 최초의 전직(52레벨 ~ 56레벨 던전을 60레벨 던전으로 강제 리뉴얼)
    ["모험[어려움]","신녀의 노랫소리",60,1,4,["아이템점수 7600점"],"던전 설명 넣는 곳","2018-07-05"],
    ["모험[어려움]","대양의 수호신",60,1,4,["아이템점수 7600점"],"던전 설명 넣는 곳","2018-07-05"],
    ["모험[어려움]","눈보라 산맥",60,1,4,["아이템점수 7600점"],"던전 설명 넣는 곳","2018-07-05"],
    ["모험[어려움]","마드라칸 성벽",60,1,4,["아이템점수 7600점"],"던전 설명 넣는 곳","2018-07-05"],
    ["모험[어려움]","마드라칸 잠입",60,1,4,["아이템점수 7600점", "트로피 : 분노의 요새 : 성벽 점령 달성"],"던전 설명 넣는 곳","2018-07-05"],
    ["모험[어려움]","사무친 원한의 대저택",60,1,4,["아이템점수 8200점"],"던전 설명 넣는 곳","2018-07-05"],
    ["카오스 레이드","마드라칸 첨탑",60,1,10,["아이템점수 9900점", "트로피 : 분노의 요새 : 잠입로 확보 달성"],"던전 설명 넣는 곳","2018-07-05"],
    ["카오스 레이드","서릿발 신전",60,1,10,["아이템점수 9900점"],"던전 설명 넣는 곳","2018-07-05"],
    ["카오스 레이드","이계의 존재",60,1,10,["아이템점수 9900점"],"던전 설명 넣는 곳","2018-07-05"],
    
    // 아이 오브 라펜타
    ["아이 오브 라펜타","에메랄드 프리즌",60,1,4,["아이템점수 11500점", "그린 라펜샤드에 공명 필요", "시간의 검 효과 필요"],"2018-08-16"],
    ["아이 오브 라펜타","그레이브 블루",60,1,4,["아이템점수 11500점", "블루 라펜샤드에 공명 필요","유페리아의 가호 필요"],"2018-08-16"],
    ["아이 오브 라펜타","터미너스 엔즈",60,1,4,["아이템점수 11500점", "레드 라펜샤드에 공명 필요", "공간 균열 효과 필요"],"2018-08-16"],
    ["아이 오브 라펜타","블랙샤드 체임버",60,1,10,["아이템점수 14000점", "라펜샤드에 공명 필요", "강화된 시간의 검 효과 필요", "강화된 공간 균열 효과 필요", "강화된 유페리아의 가호 필요", "2018-08-30 이후 입장 가능"], "2018-08-16"],

    //신대륙, 크리티아스
    ["모험[어려움]","알케이나 델파이온",70,1,4,["아이템점수 12800점"]],
    ["모험[어려움]","에네르 캐슬 쟁탈전",70,1,4,["아이템점수 14000점"]],
    ["카오스 레이드","고대 에네르 광산(일반)",70,1,6,["아이템점수 19500점"]],
    ["카오스 레이드","고대 에네르 광산(어려움)",70,1,10,["아이템점수 24000점"]],
    ["카오스 레이드","인페르녹 최후의 결전(일반)",70,1,6["아이템점수 24500점"]],
    ["카오스 레이드","인페르녹 최후의 결전(어려움)",70,1,10["아이템점수 28000점"]],

    ["퀸크빈 럼블","퀸크빈 럼블",70,1,1, ["아이템점수 19000점"]],

    //크리티아스 확장 업데이트 - 칠흑의 성전, 그리고 투르카
    ["칠흑의 성전","숨겨진 격납고",70,1,4],
    ["칠흑의 성전","공중요새 티마이온",70,1,4],
    ["칠흑의 성전","음모의 전당",70,1,10],

    //이벤트용 던전 - 타이렌 로열 장비 보급용
    ["이벤트", "카트라무스 하층",60,1,4],
    ["이벤트", "카트라무스 상층",60,1,4],
    ["이벤트", "블랙 오닉스 타워",60,1,1],

    //시공의 균열, 블랙빈
    ["모험[어려움]","환영의 트로닉스 벙커",70,1,4, ["아이템점수 35500점"]], //타이렌 로열 장비 보급용 던전
    ["모험[어려움]","환영의 잊혀진 바야르",70,1,4, ["아이템점수 12300점"]],
    ["카오스 레이드","환영의 푸른 그림자 동굴(일반)",70,1,4,["아이템점수 12300점"]],
    ["카오스 레이드","환영의 푸른 그림자 동굴(어려움)",70,1,6,["아이템점수 92300점"]],
    ["카오스 레이드","환영의 호루스의 둥지(일반)",70,1,4, ["아이템점수 183600"]],
    ["카오스 레이드","환영의 호루스의 둥지(어려움)",70,1,6, ["아이템점수 198600점"]],
    ["카오스 레이드","우당탕 블랙빈 놀이터(일반)",70,1,4, ["아이템점수 231000점"]],
    ["카오스 레이드","우당탕 블랙빈 놀이터(어려움)",70,1,10, ["아이템점수 255000점"]],

    //2020.07.09 업데이트 던전
    ["모험[어려움]","환영의 불멸의 신전",70,1,4,["아이템 점수 183600점"],"잠든 줄 알았던 발록이 다시 깨어났다. 더 깊은 곳에서 더욱 더 강해진 힘으로 우리를 위협하고 있다. 다시 발록을 잠재울 수 있는 자는 누구인가?"],
    ["이벤트", "매드 닥터 피피의 연구소",70,1,2,["아이템 점수 60700점"],"시간의 흐름을 어지럽히며 메이플 월드를 정복하려는 닥터 피피, 닥터 피피의 연구소에서 모험가들의 힘과 메이플 월드의 몬스터들을 철저히 분석해 만든 몬스터들이 등장했다고 한다.\n 매드 닥터의 연구소로 가서 닥터 피피의 코를 납작하게 눌러주자.","2020-07-09"],
    

    //2020.08.13 업데이트 던전
    ["카오스 레이드","환영의 그림자 제단(일반)",70,1,4,["아이템 점수 231000점"],"잠든 줄 알았던 데보라크가 다시 깨어났다. 더 깊은 곳에서 더욱 더 강해진 힘으로 우리를 위협하고 있다. 다시 데보라크를 잠재울 수 있는 자는 누구인가?", "2020-08-13"],
    ["카오스 레이드","환영의 그림자 제단(어려움)",70,1,6,["아이템 점수 255000점"],"잠든 줄 알았던 데보라크가 다시 깨어났다. 더 깊은 곳에서 더욱 더 강해진 힘으로 우리를 위협하고 있다. 다시 데보라크를 잠재울 수 있는 자는 누구인가?", "2020-08-13"],

    //2021.01.14 업데이트 이벤트 던전 (다크 티어, 검은 눈물 아라키아)
    ["이벤트","어둠의 샘",50,1,4,["아이템 점수 2021점"],, "2021-01-14", "2021-02-18"],
    
    //2021.02.18 업데이트 던전 (이계의 놀이터, 크리스탈 샤인드 액세서리 조각)
    ["카오스 레이드","이계의 놀이터(일반)",70,1,4,["아이템 점수 203000점"],"이계에서 소환된 장난꾸러기 블랙빈과 핑크빈이 모험가들을 그들의 놀이터로 소환했다. 블랙빈과 핑크빈을 물리치고 이계의 놀이터를 탈출하자.", "2021-02-18"],
    ["카오스 레이드","이계의 놀이터(어려움)",70,1,6,["요구 레벨 80","아이템 점수 265000점"],"이계에서 소환된 장난꾸러기 블랙빈과 핑크빈이 모험가들을 그들의 놀이터로 소환했다. 블랙빈과 핑크빈을 물리치고 이계의 놀이터를 탈출하자.", "2021-02-18"],

    //2021.09.09 업데이트 던전 (푸른 화염의 혼돈, 블루 루크)
    ["카오스 레이드","푸른 화염의 혼돈(일반)",70,1,6,["요구 레벨 80", "아이템 점수 335000점"],"영원의 동굴 깊숙한 곳, 한때 영혼의 성채라 불리었던 지역 깊은 곳에서 수상한 공간이 발견되었다. 푸른 화염으로 뒤덮혀 강력한 힘이 느껴지는 이곳에는 거대한 골렘만이 남아있다. 대체 이곳에서 무슨 일이 있었던것일까? 우선 폭주화가 시작된 골렘을 잠재워보자.", "2021-09-09"],
    ["카오스 레이드","푸른 화염의 혼돈(어려움)",70,1,6,["요구 레벨 80", "아이템 점수 383000점"],"영원의 동굴 깊숙한 곳, 한때 영혼의 성채라 불리었던 지역 깊은 곳에서 수상한 공간이 발견되었다. 푸른 화염으로 뒤덮혀 강력한 힘이 느껴지는 이곳에는 거대한 골렘만이 남아있다. 대체 이곳에서 무슨 일이 있었던것일까? 우선 폭주화가 시작된 골렘을 잠재워보자.", "2021-09-09"],

    //2022. 01.13 업데이트 던전 (블랙 엠퍼러 모자/장갑/신발)
    ["카오스 레이드","환영의 비욘드 링크 트리스[일반]",70,1,6,["아이템 점수 231000점"],"휴머노이드 공학이라는 기만책을 펼치며, 위험한 연구룰 총괄한 칸두라! 그림자 군단에 필적할 새로운 군단의 탄생은 이제 막바지에 이르렀는데… 칸두라를 쓰러뜨리고 그의 연구를 저지할 자는 과연 누구인가!", "2022-01-13"],
];

let ms2_dungeon_categorized_datas = ms2_dungeon_datas.reduce((a,c)=>{Array.isArray(a[c[0]]) ? a[c[0]].push(c) : a[c[0]]=[c]; return a;},{}); //categorized as dungeon-type(s) using dict(object type as javascript) type
let ms2_dictdata_dungeon_datas = new DictData("전체", ms2_dungeon_tagtypes, ms2_dungeon_datas, "ms2-dict-represent-area"); //create full dungeon info dictdata (to use as see full dungeon infos when page is opened first with header title position)
let ms2_dict_categorized_dictdatas = Object.keys(ms2_dungeon_categorized_datas).reduce((a,c)=>{a.push(new DictData(c,ms2_dungeon_tagtypes,ms2_dungeon_categorized_datas[c], "ms2-dict-represent-area")); return a},[ms2_dictdata_dungeon_datas]); //categorized dictdatas creation with behinds to the original dictdatas
let ms2_dict_collections = new DictCollection(...ms2_dict_categorized_dictdatas); //create dictcollection with categorized dictdatas(flattening the dictdata array to using as arguments)

/* release under two lines when if you don't want categorize dungeon types and just want to see only full dungeon infos */
//let ms2_dictdata_dungeon_datas = new DictData("던전", ms2_dungeon_tagtypes, ms2_dungeon_datas);
//let ms2_dict_collections = new DictCollection(ms2_dictdata_dungeon_datas);

window.onload = function (e) {
    ms2_dict_collections.representData();
    //ms2_bgms.representData();
    // ms2_bgms.clearTags();
}